apache/nuttx/arch/arm/src/common/stm32/stm32_pulsecount_m3m4_v1v2v3.c
static int pulsecount_ll_setup(struct pulsecount_lowerhalf_s *dev);
static int pulsecount_ll_shutdown(struct pulsecount_lowerhalf_s *dev);

static int pulsecount_ll_stop(struct pulsecount_lowerhalf_s *dev);
static int pulsecount_ll_ioctl(struct pulsecount_lowerhalf_s *dev,
                               int cmd, unsigned long arg);

static int pulsecount_setup(struct pulsecount_lowerhalf_s *dev);
static int pulsecount_shutdown(struct pulsecount_lowerhalf_s *dev);
static int pulsecount_start(struct pulsecount_lowerhalf_s *dev,
                            const struct pulsecount_info_s *info,
                            void *handle);
static int pulsecount_stop(struct pulsecount_lowerhalf_s *dev);
static int pulsecount_ioctl(struct pulsecount_lowerhalf_s *dev,
                            int cmd, unsigned long arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifdef CONFIG_STM32_TIM1_PULSECOUNT

static struct stm32_tim_s g_pulsecount1dev =
{
  .channel =
  {
    .channel = CONFIG_STM32_TIM1_PULSECOUNT_CHANNEL,
#if CONFIG_STM32_TIM1_PULSECOUNT_CHANNEL == 1
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM1_PULSECOUNT_POL,
      .idle    = CONFIG_STM32_TIM1_PULSECOUNT_IDLE,
      .pincfg  = GPIO_TIM1_CH1OUT,
    },
#elif CONFIG_STM32_TIM1_PULSECOUNT_CHANNEL == 2
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM1_PULSECOUNT_POL,
      .idle    = CONFIG_STM32_TIM1_PULSECOUNT_IDLE,
      .pincfg  = GPIO_TIM1_CH2OUT,
    },
#elif CONFIG_STM32_TIM1_PULSECOUNT_CHANNEL == 3
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM1_PULSECOUNT_POL,
      .idle    = CONFIG_STM32_TIM1_PULSECOUNT_IDLE,
      .pincfg  = GPIO_TIM1_CH3OUT,
    },
#elif CONFIG_STM32_TIM1_PULSECOUNT_CHANNEL == 4
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM1_PULSECOUNT_POL,
      .idle    = CONFIG_STM32_TIM1_PULSECOUNT_IDLE,
      .pincfg  = GPIO_TIM1_CH4OUT,
    },
#endif
  },
  .timid       = 1,
  .timtype     = TIMTYPE_TIM1,
  .t_dts       = CONFIG_STM32_TIM1_PULSECOUNT_TDTS,
  .irq         = STM32_IRQ_TIM1UP,
  .base        = STM32_TIM1_BASE,
  .pclk        = TIMCLK_TIM1,
};

#endif /* CONFIG_STM32_TIM1_PULSECOUNT */

#ifdef CONFIG_STM32_TIM8_PULSECOUNT

static struct stm32_tim_s g_pulsecount8dev =
{
  .channel =
  {
    .channel = CONFIG_STM32_TIM8_PULSECOUNT_CHANNEL,
#if CONFIG_STM32_TIM8_PULSECOUNT_CHANNEL == 1
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM8_PULSECOUNT_POL,
      .idle    = CONFIG_STM32_TIM8_PULSECOUNT_IDLE,
      .pincfg  = GPIO_TIM8_CH1OUT,
    },
#elif CONFIG_STM32_TIM8_PULSECOUNT_CHANNEL == 2
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM8_PULSECOUNT_POL,
      .idle    = CONFIG_STM32_TIM8_PULSECOUNT_IDLE,
      .pincfg  = GPIO_TIM8_CH2OUT,
    },
#elif CONFIG_STM32_TIM8_PULSECOUNT_CHANNEL == 3
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM8_PULSECOUNT_POL,
      .idle    = CONFIG_STM32_TIM8_PULSECOUNT_IDLE,
      .pincfg  = GPIO_TIM8_CH3OUT,
    },
#elif CONFIG_STM32_TIM8_PULSECOUNT_CHANNEL == 4
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM8_PULSECOUNT_POL,
      .idle    = CONFIG_STM32_TIM8_PULSECOUNT_IDLE,
      .pincfg  = GPIO_TIM8_CH4OUT,
    },
#endif
  },
  .timid       = 8,
  .timtype     = TIMTYPE_TIM8,
  .t_dts       = CONFIG_STM32_TIM8_PULSECOUNT_TDTS,
  .irq         = STM32_IRQ_TIM8UP,
  .base        = STM32_TIM8_BASE,
  .pclk        = TIMCLK_TIM8,
};

#endif /* CONFIG_STM32_TIM8_PULSECOUNT */

static const struct pulsecount_ops_s g_pulsecountops =
{
  .setup       = pulsecount_setup,
  .shutdown    = pulsecount_shutdown,
  .start       = pulsecount_start,
  .stop        = pulsecount_stop,
  .ioctl       = pulsecount_ioctl,
};

#ifdef CONFIG_STM32_TIM1_PULSECOUNT
static struct stm32_pulsecount_s g_pulsecount1lower =
{
  .ops = &g_pulsecountops,
  .timer = &g_pulsecount1dev,
};
#endif

#ifdef CONFIG_STM32_TIM8_PULSECOUNT
static struct stm32_pulsecount_s g_pulsecount8lower =
{
  .ops = &g_pulsecountops,
  .timer = &g_pulsecount8dev,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: pulsecount_reg_is_32bit
 ****************************************************************************/

static bool pulsecount_reg_is_32bit(uint8_t timtype, uint32_t offset)
{
  bool ret = false;

  if (timtype == TIMTYPE_ADVANCED)
    {
      if (offset == STM32_ATIM_CR2_OFFSET ||
          offset == STM32_ATIM_CCMR1_OFFSET ||
          offset == STM32_ATIM_CCMR2_OFFSET ||
          offset == STM32_ATIM_CCER_OFFSET ||
          offset == STM32_ATIM_BDTR_OFFSET)
        {
          ret = true;
        }
    }

  return ret;
}

/****************************************************************************
 * Name: pulsecount_getreg
 *
 * Description:
 *   Read the value of an pulsecount timer register
 *
 * Input Parameters:
 *   priv   - A reference to the pulsecount block status
 *   offset - The offset to the register to read
 *
 * Returned Value:
 *   The current contents of the specified register
 *
 ****************************************************************************/

static uint32_t pulsecount_getreg(struct stm32_tim_s *priv, int offset)
{
  uint32_t retval = 0;

  if (pulsecount_reg_is_32bit(priv->timtype, offset) == true)
    {
      /* 32-bit register */

      retval = getreg32(priv->base + offset);
    }
  else
    {
      /* 16-bit register */

      retval = getreg16(priv->base + offset);
    }

  /* Return 32-bit value */

  return retval;
}

/****************************************************************************
 * Name: pulsecount_putreg
 *
 * Description:
 *   Read the value of an pulsecount timer register
 *
 * Input Parameters:
 *   priv   - A reference to the pulsecount block status
 *   offset - The offset to the register to read
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

