apache/nuttx/arch/arm/src/common/stm32/stm32_pulsecount_m3m4_v1v2v3.c
  /* Set up the advanced timer CR1 register. */

  cr1 = pulsecount_getreg(priv, STM32_GTIM_CR1_OFFSET);

  /* Pulsecount always uses edge-aligned up-counting mode. */

  cr1 &= ~(GTIM_CR1_DIR | GTIM_CR1_CMS_MASK);
  cr1 |= GTIM_CR1_EDGE;
  cr1 &= ~GTIM_CR1_CKD_MASK;
  cr1 |= priv->t_dts << GTIM_CR1_CKD_SHIFT;

  /* Enable ARR preload to preserve the previous pulsecount behavior. */

  cr1 |= GTIM_CR1_ARPE;

  /* Write CR1 */

  pulsecount_putreg(priv, STM32_GTIM_CR1_OFFSET, cr1);

  return OK;
}

/****************************************************************************
 * Name: pulsecount_channel_configure
 *
 * Description:
 *   Configure pulsecount output compare for a channel
 *
 ****************************************************************************/

static int pulsecount_channel_configure(struct pulsecount_lowerhalf_s *dev,
                                        uint8_t channel)
{
  struct stm32_tim_s *priv = (struct stm32_tim_s *)dev;
  uint32_t chanmode = 0;
  uint32_t ocmode   = 0;
  uint32_t ccmr     = 0;
  uint32_t offset   = 0;
  int      ret      = OK;

  /* Configure output compare mode */

  chanmode = GTIM_CCMR_MODE_PWM1;

  /* Get CCMR offset */

  switch (channel)
    {
      case 1:
      case 2:
        {
          offset = STM32_GTIM_CCMR1_OFFSET;
          break;
        }

      case 3:
      case 4:
        {
          offset = STM32_GTIM_CCMR2_OFFSET;
          break;
        }

      default:
        {
          _err("ERROR: No such channel: %u\n", channel);
          ret = -EINVAL;
          goto errout;
        }
    }

  /* Get current registers */

  ccmr = pulsecount_getreg(priv, offset);

  /* output compare configuration.
   * NOTE: The CCMRx registers are identical if the channels are outputs.
   */

  switch (channel)
    {
      /* Configure channel 1/3 */

      case 1:
      case 3:
        {
          ccmr &= ~(ATIM_CCMR1_CC1S_MASK | ATIM_CCMR1_OC1M_MASK |
                     ATIM_CCMR1_OC1PE);
          ocmode |= (ATIM_CCMR_CCS_CCOUT << ATIM_CCMR1_CC1S_SHIFT);
          ocmode |= (chanmode << ATIM_CCMR1_OC1M_SHIFT);
          ocmode |= ATIM_CCMR1_OC1PE;
#ifdef HAVE_IP_TIMERS_V2
          ccmr &= ~(ATIM_CCMR1_OC1M);
#endif
          break;
        }

      /* Configure channel 2/4 */

      case 2:
      case 4:
        {
          ccmr &= ~(ATIM_CCMR1_CC2S_MASK | ATIM_CCMR1_OC2M_MASK |
                     ATIM_CCMR1_OC2PE);
          ocmode |= (ATIM_CCMR_CCS_CCOUT << ATIM_CCMR1_CC2S_SHIFT);
          ocmode |= (chanmode << ATIM_CCMR1_OC2M_SHIFT);
          ocmode |= ATIM_CCMR1_OC2PE;
#ifdef HAVE_IP_TIMERS_V2
          ccmr &= ~(ATIM_CCMR1_OC2M);
#endif
          break;
        }
    }

  /* Set the selected output compare configuration */

  ccmr |= ocmode;

  /* Write CCMRx registers */

  pulsecount_putreg(priv, offset, ccmr);

errout:
  return ret;
}

/****************************************************************************
 * Name: pulsecount_output_configure
 *
 * Description:
 *   Configure pulsecount output for given channel
 *
 ****************************************************************************/

static int pulsecount_output_configure(struct stm32_tim_s *priv,
                                       struct stm32_chan_s *chan)
{
  uint32_t cr2  = 0;
  uint32_t ccer = 0;
  uint8_t  channel = 0;

  /* Get channel */

  channel = chan->channel;

  /* Get current registers state */

  cr2  = pulsecount_getreg(priv, STM32_GTIM_CR2_OFFSET);
  ccer = pulsecount_getreg(priv, STM32_GTIM_CCER_OFFSET);

  /* | OISx | IDLE | advanced timers | CR2 register
   * | CCxP | POL  | all pulsecount timers | CCER register
   */

  /* Configure output polarity (all pulsecount timers) */

  if (chan->out1.pol == PULSECOUNT_POL_NEG)
    {
      ccer |= (GTIM_CCER_CC1P << ((channel - 1) * 4));
    }
  else
    {
      ccer &= ~(GTIM_CCER_CC1P << ((channel - 1) * 4));
    }

  if (priv->timtype == TIMTYPE_ADVANCED)
    {
      /* Configure output IDLE State */

      if (chan->out1.idle == PULSECOUNT_IDLE_ACTIVE)
        {
          cr2 |= (ATIM_CR2_OIS1 << ((channel - 1) * 2));
        }
      else
        {
          cr2 &= ~(ATIM_CR2_OIS1 << ((channel - 1) * 2));
        }
    }

  /* Write registers */

  pulsecount_modifyreg(priv, STM32_GTIM_CR2_OFFSET, 0, cr2);
  pulsecount_modifyreg(priv, STM32_GTIM_CCER_OFFSET, 0, ccer);

  return OK;
}

/****************************************************************************
 * Name: pulsecount_outputs_enable
 *
 * Description:
 *   Enable/disable given timer pulsecount outputs.
 *
 *   NOTE: This is bulk operation - we can enable/disable many outputs
 *   at one time
 *
 * Input Parameters:
 *   dev     - A reference to the lower half driver state structure
 *   outputs - outputs to set (look at enum stm32_pulsecount_chan_e)
 *   state   - Enable/disable operation
 *
 ****************************************************************************/

static int pulsecount_outputs_enable(struct pulsecount_lowerhalf_s *dev,
                                     uint16_t outputs, bool state)
{
  struct stm32_tim_s *priv = (struct stm32_tim_s *)dev;
  uint32_t ccer   = 0;
  uint32_t regval = 0;

  /* Get current register state */

  ccer = pulsecount_getreg(priv, STM32_GTIM_CCER_OFFSET);

  /* Get outputs configuration */

  regval |= ((outputs & (1 << 0))  ? GTIM_CCER_CC1E  : 0);
  regval |= ((outputs & (1 << 2))  ? GTIM_CCER_CC2E  : 0);
  regval |= ((outputs & (1 << 4))  ? GTIM_CCER_CC3E  : 0);
  regval |= ((outputs & (1 << 6))  ? GTIM_CCER_CC4E  : 0);

  if (state == true)
    {
      /* Enable outputs - set bits */

      ccer |= regval;
    }
  else
    {
      /* Disable outputs - reset bits */

      ccer &= ~regval;
    }

  /* Write register */

  pulsecount_putreg(priv, STM32_GTIM_CCER_OFFSET, ccer);

  return OK;
}

/****************************************************************************
 * Name: pulsecount_moe_enable
 ****************************************************************************/

static void pulsecount_moe_enable(struct pulsecount_lowerhalf_s *dev,
                                  bool enable)
{
  struct stm32_tim_s *priv = (struct stm32_tim_s *)dev;

  if (enable)
    {
      pulsecount_modifyreg(priv, STM32_ATIM_BDTR_OFFSET, 0, ATIM_BDTR_MOE);
    }
  else
    {
      pulsecount_modifyreg(priv, STM32_ATIM_BDTR_OFFSET, ATIM_BDTR_MOE, 0);
    }
}

/****************************************************************************
 * Name: pulsecount_outputs_from_channels
 *
 * Description:
 *   Get enabled outputs configuration from the pulsecount timer state
 *
 ****************************************************************************/

static uint16_t
pulsecount_outputs_from_channels(struct stm32_tim_s *priv, uint8_t selected)
{
  uint16_t outputs = 0;
  uint8_t  channel;

